# 7. Напишите программу, доказывающую или проверяющую,
# что для множества натуральных чисел выполняется равенство:
# 1+2+...+n = n(n+1)/2, где n - любое натуральное число.

print("Полностью аналогично заданию 4 - только формулы другие")
# Так написать надо программу доказывающую равенство
# или проверяющую его?
# проверить - это пользователь вводит n а программа выдает два эквивалентных ответа
# а доказать - это или проверить верность равенства для каждого натурального числа
# или некий ИИ выдаст распечатку доказательства путем алгебраических преобразований,
# или метода математической индукции