# 6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

a = int(input("Введите номер буквы: "))

print("Это буква:",chr(96+a))
